cask_args appdir: "/Applications"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

### packages for work and personal use
brew "autopep8"
brew "awscli"
brew "bash"
brew "black"
brew "cookiecutter"
brew "deno" # macOS-only
brew "flake8"
brew "fx"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "gnu-sed"
brew "go"
brew "grep"
brew "httpie"
brew "jq"
brew "jupyterlab"
brew "libfido2"
brew "macos-trash" # macOS-only
brew "mas" # macOS-only
brew "mypy"
brew "node"
brew "openssh"
brew "pinentry"
brew "pipx"
brew "pnpm"
brew "postgresql"
brew "pre-commit"
brew "prettier"
brew "python"
brew "r"
brew "rust"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "terraform"
brew "typescript"
brew "webp"
brew "webtorrent-cli"
brew "ykman"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "ffmpeg"
brew "media-info"
brew "mkvtoolnix"
brew "mp4v2"

### casks for work and personal use
cask "brave-browser"
cask "docker"
cask "firefox"
cask "rstudio"
cask "visual-studio-code"
cask "vlc"

### mac app store
# mas "1password", id: 1333542190
mas "bear", id: 1091189122
mas "daisydisk", id: 411643860
mas "keynote", id: 409183694
mas "numbers", id: 409203825
mas "pages", id: 409201541
mas "xcode", id: 497799835
mas "slack", id: 803453959
mas "The Unarchiver", id: 425424353
