cask_args appdir: "/Applications"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

### packages for work and personal use
brew "autopep8"
brew "awscli"
brew "bash"
brew "black"
brew "cookiecutter"
brew "deno" # macOS-only
brew "flake8"
brew "fx"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "gnu-sed"
brew "go"
brew "grep"
brew "httpie"
brew "jq"
brew "jupyterlab"
brew "libfido2"
brew "macos-trash" # macOS-only
brew "mas" # macOS-only
brew "mypy"
brew "node"
brew "openssh"
brew "pinentry"
brew "pipx"
brew "pnpm"
brew "postgresql"
brew "pre-commit"
brew "prettier"
brew "python"
brew "r"
brew "rust"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "terraform"
brew "typescript"
brew "webp"
brew "webtorrent-cli"
brew "ykman"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "ffmpeg"
brew "media-info"
brew "mkvtoolnix"
brew "mp4v2"

### casks for work and personal use
cask "brave-browser"
cask "docker"
cask "firefox"
cask "rstudio"
cask "visual-studio-code"
cask "vlc"

### mac app store
# mas "1password", id: 1333542190
mas "Bear", id: 1091189122
mas "DaisyDisk", id: 411643860
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
mas "The Unarchiver", id: 425424353
mas "Encrypto: Secure Your Files", id: 935235287
mas "Messenger", id: 1480068668
mas "WhatsApp Desktop", id: 1147396723
mas "Twitter", id: 1482454543
mas "Slack for Desktop",id: 803453959
mas "Telegram", id: 747648890
mas "Wire", id: 931134707
mas "Infuse 7", id: 1136220934
mas " Zerion", id: 1456732565
mas "Keka", id: 470158793
mas "Notability", id: 360593530
mas "GoodNotes 5", id: 1444383602
mas "Texpad", id: 458866234
mas "Twitter", id: 1482454543
mas "Transmit 5", id: 1436522307
